
### Case Study - Country Club


**Course**:     Section 16 Data Science
**Assignment**: Case Study - Country Club
**Instructions**:  Export the country club data from PHPMyAdmin, and connect to a local SQLite instance from Jupyter notebook for the following questions.

In [77]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

### Sql statements

In [78]:
# Q10: Produce a list of facilities with a total revenue less than 1000
sql_facilities_with_low_revenue = """
with booking_revenue as (
    select
        F.name as facility,
        case when memid = 0 then (F.guestcost * slots) else (F.membercost * slots) end as booking_cost
    from Facilities as F
    inner join Bookings as B using (facid)
)
select facility, round(sum(booking_cost),2) as total_revenue
from booking_revenue
group by facility
having total_revenue < 1000
order by total_revenue desc
"""

# Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order
sql_member_recommendations ="""
select m1.firstname||" "||m1.surname as member, m2.firstname||" "||m2.surname recomended_by
from Members m1
inner join Members as m2 on m2.memid = m1.recommendedby
order by m1.surname, m1.firstname
"""

# Q12: Find the facilities with their usage by member, but not guests
sql_facility_usage_by_member = """
select F.name, M.firstname||" "||M.surname as member, count(*) as bookings
from Facilities F
    inner join Bookings B using(facid)
inner join Members M using(memid)
where memid != 0
group by F.name, B.memid
order by F.name, bookings DESC
"""

# Q13: Find the facilities usage by month, but not guests
sql_facility_usage_by_month = """
select F.name, substr(starttime,1,7) as month, count(bookid)
from Bookings
inner join Facilities F using(facid)
where memid != 0
group by F.name, month
order by F.name, month;
"""

### Questions and Answers

---
Q10: Produce a list of facilities with a total revenue less than 1000.
 The output of facility name and total revenue, sorted by revenue. Remember
 that there's a different cost for guests and members!

In [79]:
df = pd.read_sql_query(sql_facilities_with_low_revenue, engine)
df

        facility  total_revenue
0     Pool Table          270.0
1  Snooker Table          240.0
2   Table Tennis          180.0

---
Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

In [80]:
df = pd.read_sql_query(sql_member_recommendations, engine)
df

                     member      recomended_by
0            Florence Bader    Ponder Stibbons
1                Anne Baker    Ponder Stibbons
2             Timothy Baker     Jemima Farrell
3                Tim Boothe         Tim Rownam
4            Gerald Butters       Darren Smith
5               Joan Coplin      Timothy Baker
6             Erica Crumpet        Tracy Smith
7                Nancy Dare    Janice Joplette
8           Matthew Genting     Gerald Butters
9                 John Hunt  Millicent Purview
10              David Jones    Janice Joplette
11            Douglas Jones        David Jones
12          Janice Joplette       Darren Smith
13           Anna Mackenzie       Darren Smith
14             Charles Owen       Darren Smith
15             David Pinker     Jemima Farrell
16        Millicent Purview        Tracy Smith
17         Henrietta Rumney    Matthew Genting
18         Ramnaresh Sarwin     Florence Bader
19               Jack Smith       Darren Smith
20          Ponder Stibbons       Burton Tracy
21  Henry Worthington-Smyth        Tracy Smith

---
Q12: Find the facilities with their usage by member, but not guests

In [81]:
df = pd.read_sql_query(sql_facility_usage_by_member, engine)
df.sample(25)

                name                   member  bookings
140     Table Tennis             Burton Tracy        24
13   Badminton Court            Timothy Baker         7
66        Pool Table             Darren Smith        28
86        Pool Table             Charles Owen         1
128     Squash Court      Hyacinth Tupperware         1
57    Massage Room 2          Matthew Genting         1
184   Tennis Court 2          Ponder Stibbons        31
41    Massage Room 1             David Pinker         3
88     Snooker Table              Tracy Smith        45
29    Massage Room 1             Darren Smith        28
171   Tennis Court 1               Anne Baker         6
50    Massage Room 2         Ramnaresh Sarwin         3
68        Pool Table            David Farrell        25
164   Tennis Court 1          Janice Joplette        19
16   Badminton Court  Henry Worthington-Smyth         4
126     Squash Court          Ponder Stibbons         2
63        Pool Table              Tracy Smith        61
148     Table Tennis               Jack Smith         5
12   Badminton Court             David Pinker         7
123     Squash Court         Ramnaresh Sarwin         2
167   Tennis Court 1            Timothy Baker        14
180   Tennis Court 1          Ponder Stibbons         1
136     Table Tennis             Darren Smith        28
192   Tennis Court 2               Tim Rownam         6
32    Massage Room 1            Timothy Baker        24

---
Q13: Find the facilities usage by month, but not guests

In [82]:
df = pd.read_sql_query(sql_facility_usage_by_month, engine)
df

               name    month  count(bookid)
0   Badminton Court  2012-07             51
1   Badminton Court  2012-08            132
2   Badminton Court  2012-09            161
3    Massage Room 1  2012-07             77
4    Massage Room 1  2012-08            153
5    Massage Room 1  2012-09            191
6    Massage Room 2  2012-07              4
7    Massage Room 2  2012-08              9
8    Massage Room 2  2012-09             14
9        Pool Table  2012-07            103
10       Pool Table  2012-08            272
11       Pool Table  2012-09            408
12    Snooker Table  2012-07             68
13    Snooker Table  2012-08            154
14    Snooker Table  2012-09            199
15     Squash Court  2012-07             23
16     Squash Court  2012-08             85
17     Squash Court  2012-09             87
18     Table Tennis  2012-07             48
19     Table Tennis  2012-08            143
20     Table Tennis  2012-09            194
21   Tennis Court 1  2012-07             65
22   Tennis Court 1  2012-08            111
23   Tennis Court 1  2012-09            132
24   Tennis Court 2  2012-07             41
25   Tennis Court 2  2012-08            109
26   Tennis Court 2  2012-09            126